index.html
---
layout: page
title: Software Usage Collection and Analysis with ELK at CAEN
---

<p>
CAEN supports 100s of software packages in its student computing labs
and in its HPC environment, and the list grows every year.  To help us
make decisions about software usage patterns, we wanted to collect and
analyze data on a per-title, per-computer, per-user basis.
</p>

<p>
By gathering software usage information for everything that CAEN
installs, we hope to:
</p>
<ul class="org-ul">
<li>get a better understanding of what software is used, so we can
remove titles that we don’t need to be installing
</li>
<li>correlate titles with courses, and try to suggest that similar
courses use the same software to minimize what the students have to
learn, the instructors have to teach, and CAEN has to support
</li>
<li>make purchasing and labor decisions based on more than just an
educated guess
</li>
</ul>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">ELK</h2>
<div class="outline-text-2" id="text-1">
<p>
The open-source <a href="http://www.elasticsearch.org/overview/">ELK stack</a> allows us to process, aggregate, store,
search, and analyze logs with a lot of metadata from Windows and
Linux computers.
</p>
<ul class="org-ul">
<li>Elasticsearch is based on Apache Lucene and is a very fast,
distributed real-time search and analytics engine that offers a rich
query DSL via a REST API
</li>
<li>Logstash converts logs to JSON according to your rules and ships
them to Elasticsearch
</li>
<li>Kibana is a real-time visualization engine for Elastic- search
</li>
</ul>

<p>
We also use the <a href="http://beaver.readthedocs.org/">Beaver Python daemon</a> to ship logs to Logstash from
the Linux Lab computers.
</p>

<p>
Elasticsearch also allows us to modify log entries after the fact,
so we are going to insert demographic and role data to augment the
username field. This data will include things like class standing
(Freshman, Sophomore, etc.), department, course enrollment, and
affiliation (Alumni, Student, Staff, etc.).
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Our ELK Environment</h2>
<div class="outline-text-2" id="text-2">
<p>
The ELK Environment at CAEN consists of a two-node Elasticsearch
cluster, a log aggregation server to collect the logs from Beaver,
and a Kibana web server to present some of the data.
</p>

<p>
The College of Engineering computer labs have about 1000 computers,
each of which dual-boots into either Linux or Windows.  When they
are running Linux, they use the Beaver Python daemon to deliver
their software usage information to an aggregation server that does
some processing and delivers the logs on to the Elasticsearch
cluster.  When the computers are running Windows, about a dozen of
them log their software usage.  This is a test before we deploy the
logging agents to the rest of the Windows computers.
</p>

<p>
The HPC Cluster comprises about 1500 computers, all of which run
Logstash as a daemon and deliver their logs via Redis to the
Elasticsearch cluster.
</p>

<p>
The configuration of each of these is different.  The Linux
computers in the computer labs use <a href="linux-lab-beaver.html">Beaver and its configuration</a> to
gather and ship software usage information from the <code>auditd</code> logs.
The Linux computers that make up the HPC cluster use <a href="linux-hpc-logstash.html">Logstash and
its configuration</a> to gather and ship software usage information from
their <code>auditd</code> logs.  The Windows computers in the computer labs use
the <i>Audit Process Creation on Success</i> and <i>Audit Process
Termination on Success</i> settings in the Group Policy to log those
events via the Windows Event log, where Logstash picks up those
entries using <a href="windows-lab-logstash.html">a Windows-specific Logstash configuration file</a>.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Results</h2>
<div class="outline-text-2" id="text-3">
<p>
Once the data is in Elasticsearch, it is replicated between our two
nodes and is available for searching.
</p>

<p>
Kibana is the web-based front-end that is part of the ELK
stack.<sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> Some examples of representing software usage data and
other data in Kibana are <a href="kibana-examples.html">here</a>.
</p>

<p>
You can also query Elasticsearch directly, using either a URL query
string, or a JSON-structured <code>GET</code> query.  Version 3 of Kibana
doesn&rsquo;t support aggregating data (this is similar to SQL <code>JOIN</code>
statements), where as the JSON-structured queries do.  Additionally,
having data reported via a Python script can sometimes be more
useful than data reported via a web page.  Some examples of direct
queries are <a href="elasticsearch-queries.html">here</a>.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" name="fn.1" class="footnum" href="#fnr.1">1</a></sup> <p class="footpara">
Other analysis and presentation engines can also be used with
Logstash data.  We also use Graphite to ingest data from Logstash from
our Luster Object Storage Servers, skipping Elasticsearch altogether.
</p></div>


</div>
</div>
